package sec1;

public class Q3_5 {
    public static void main(String[] args) {
        int num1 = 2;                       // 0000 0000 0000 0000 0000 0000 0000 0010
        int num2 = 10;                      // 0000 0000 0000 0000 0000 0000 0000 1010
        
        // 비트 연산
        System.out.println(num1 & num2);    // 0000 0000 0000 0000 0000 0000 0000 0010 => 2
        System.out.println(num1 | num2);    // 0000 0000 0000 0000 0000 0000 0000 1010 => 10
        System.out.println(num1 ^ num2);    // 0000 0000 0000 0000 0000 0000 0000 1000 => 8
        System.out.println(~num1);          // 1111 1111 1111 1111 1111 1111 1111 1101 => -3 (~ 연산으로 비트 반전, 11...1101의 보수 구하기)

        // 8비트 : -128 ~ 127     -2의 n-1승 부터 2의 n-1승 -1
        // -    : -128 ~ 127    .... -3 -2 -1
        // +    : 127 126   ...
    }
}
