package QnA;

public class Q5_1 {
    /*
        1번 클래스를 생성할 때 호출하는      생성자     은(는) 인스턴스 변수를 초기화하는데 사용합니다.
        2번 클래스를 생성하여 메모리에 있는 상태를        인스턴스         (이)라고 하고, 멤버 변수를 다른 말로          인스턴스 변수         라고 합니다.
        3번 메서드          은(는) 일반 함수에 객체 지향의 개념을 추가하여, 클래스 내부에 선언하고 클래스 인스턴스 변수를 사용하여 클래스 기능을 구현합니다.
        4번 캡슐화와 정보 은닉이 객체 지향 프로그래밍에서 중요한 이유는 무엇인가요? => 오류 방지/ 접근제한자를 이용해서 접근을 제어하고 정보의 안정성을 보장
        5번 디폴트생성자     은(는) 아무런 클래스에 그 어떤 생성자도 구현되지 않았을때 컴파일러가 자동으로 만들어 주는 생성자입니다.
     */
}
